#pragma once
#include "Card.h"
///////////////////////////////////////////////////////////////////////
//          йкюяя йнкндю, яндепфюыхи б яеае хмдейя йпюимеи йюпрш,    //
//          люяяхб назейрнб йкюяяю CARD х бхпрсюкэмше лерндш         //
//          бнгбпюрю йюпрш, цемепюжхх яксвюимни йнкндш               // 
///////////////////////////////////////////////////////////////////////

class Deck {
public:
    int number = 51;
    Card cards[52];
    Card getCard();
    void generateDeck();
    void printDeck();
};